import z from "zod";

export const password = z
  .string()
  .min(8, "Пароль повинен містити щонайменше 8 символів.")
  .max(128, "Пароль користувача повинен містити не більше 32 символів");

export const username = z
  .string("Не валідне ім'я користувача")
  .min(1, "Ім'я користувача повинно містити щонайменше 1 символ")
  .max(32, "Ім'я користувача повинно містити не більше 32 символів");

export const email = z.email("Не валідна електронна адреса");

export const code = z
  .string("Не валідний код")
  .length(6, "Код повинен містити 6 символів");

export const identifier = z
  .string("Ідентифікатор не валiдний")
  .min(1, "Ідентифікатор користувача повинен містити щонайменше 1 символ")
  .max(32, "Ідентифікатор користувача повинен містити не більше 32 символів");
