import { Card } from "@/features/ui/cards/ui/Card";

export const Cards = () => {
  return (
    <div className="flex flex-col gap-8 justify-center items-center gap-2 w-full max-w-6xl mx-auto h-full ">
      <h2 className="text-3xl font-semibold" id="exhibits">
        Експонати
      </h2>

      <ul className="grid grid-cols-1 sm:grid-cols-2 lg:grid-cols-3 w-full h-full gap-4">
        <li>
          <Card
            src="/exhibits/exhibit1.jpg"
            qrText="На зображенні представлений повнорозмірний макет або експонат космічного корабля серії «Союз» (модифікацій «Союз-Т» або «Союз-ТМ»), підвішений під стелею музейної зали. На фото чітко видно три основні частини апарата: кулястий побутовий відсік спереду з блакитною смугою та ілюмінаторами, центральний спускаймий апарат для екіпажу та циліндричний приладно-агрегатний відсік із розгорнутими сонячними батареями позаду. На задньому плані видно музейну експозицію з іншими космічними апаратами, обтікачами та декоративним глобусом Землі на темному тлі."
          ></Card>
        </li>

        <li>
          <Card src="/exhibits/exhibit2.jpg" qrText="На зображенні зображений справжній спускаймий апарат космічного корабля першого покоління серії «Восток» (або серії «Зеніт»/«Восход»), який експонується в музеї. Сфера має характерні сліди сильного обвуглювання та термічного впливу, що залишилися після проходження щільних шарів атмосфери під час повернення з орбіти. Апарат встановлений на металевій підставці зі знятим круглим люком, розташованим поруч, що дозволяє роздивитися внутрішню частину конструкції та металеві кріплення. На задньому плані видно музейну залу з портретами та іншими космічними експонатами."></Card>
        </li>

        <li>
          <Card src="/exhibits/exhibit3.jpg" qrText="На зображенні представлений музейний експонат — спускаймий апарат автоматичної міжпланетної станції (імовірно серії «Венера» або «Марс»), розміщений на спеціальній металевій підставці. Корпус апарата має характерну білу сферично-конічну форму, а у його верхньому відкритому відсіку видно елементи парашутної системи, атени та наукове обладнання. На задньому плані зображено музейну експозицію з портретами видатних учених та конструкторів (зокрема В. П. Глушка та С. П. Корольова), а також макетами ракет-носіїв у вітринах."></Card>
        </li>

        <li>
          <Card src="/exhibits/exhibit4.jpg" qrText="На зображенні представлений музейний експонат штучного супутника Землі (імовірно, серії «Ореол» або «Молнія»), підвішений під стелею музейної зали на тлі характерних помаранчевих геометричних металоконструкцій купола. Апарат має циліндричний центральний корпус із золотавою термоізоляцією, довкіл якого розміщені прямокутні панелі сонячних батарей із синіми фотоелементами, а також довгі стрижневі антени та датчики наукового обладнання, що спрямовані в різні боки. На задньому плані видно темні стіни зали та фрагменти інших космічних експонатів."></Card>
        </li>

        <li>
          <Card src="/exhibits/exhibit5.jpg" qrText="На зображенні представлений повнорозмірний макет або експонат першого у світі автоматичного місяцехода «Місяцехід-1» (або «Місяцехід-2»), розташований у музейній залі. Апарат має характерний корпус у формі відра з відкритою опуклою кришкою, внутрішня сторона якої вкрита сонячними батареями, та самохідне восьмиколісне шасі із сітчастими колесами. На передній частині та корпусі апарата чітко видно наукові прилади, оптичні камери, датчики, а також спіральну та конусну антени для зв'язку з Землею."></Card>
        </li>

        <li>
          <Card src="/exhibits/exhibit6.jpg" qrText="На зображенні представлений музейний експонат рідинного ракетного двигуна (імовірно, чотирикамерного двигуна типу РД-107 або РД-108, що використовувалися на ракетах-носіях «Восток» і «Союз»), встановлений на п'єдесталі у залі музею. На передньому плані чітко видно камери згоряння з розширюваними соплами сірого кольору та серійним маркуванням, а у верхній частині — складну систему трубопроводів, насосів та турбонасосний агрегат. Зліва від двигуна розташована біла носова частина ракетного обтікача або геофізичної ракети, а на задньому плані видно музейні інформаційні стенди та вітрини."></Card>
        </li>

        <li>
          <Card src="/exhibits/exhibit7.jpg" qrText="На зображенні представлений фрагмент підвісної художньо-музейної інсталяції з космічною тематикою, розташованої під стелею музейної зали. У центрі кадру видно велику горизонтальну панель сонячної батареї сітчастої структури, навколо якої підвішені декоративні геометричні металеві рамки трикутної форми різних розмірів та стилізована червона фігура (що нагадує птаха або паперовий літачок). Усе це закріплено на тонких тросах на тлі темної стелі з металевими конструкціями та зоряним декоративним оформленням."></Card>
        </li>

        <li>
          <Card src="/exhibits/exhibit8.jpg" qrText="На зображенні представлений музейний експонат — захисний скафандр космонавта (імовірно типу «Сокіл» або «Орлан»), розміщений у заскленій вітрині в сидячій позі. Поруч із манекеном у вітрині знаходяться елементи спорядження, зокрема радіоприлад або пульт керування з круглим індикатором та складені елементи екіпірування. На задньому плані крізь скляні панелі вітрини видно музейну експозицію з тематичними фотографіями, картинами та зображеннями флори і фауни."></Card>
        </li>

        <li>
          <Card src="/exhibits/exhibit9.jpg" qrText="На зображенні представлений той самий музейний макет космічного корабля серії «Союз», але з іншого, бічного ракурсу, що дозволяє детальніше роздивитися його будову. Справа розташований кулястий побутовий відсік з блакитною смугою та стикувальною антеною, у центрі — спускаймий апарат для екіпажу, а зліва — приладно-агрегатний відсік із відкритими сітчастими сонячними батареями та радіаторами системи терморегулювання. Апарат підвішений під стелею музейної зали з яскравим точковим освітленням на темному тлі."></Card>
        </li>

        <li>
          <Card src="/exhibits/exhibit10.jpg" qrText="На зображенні представлений музейний експонат — зразки космічного харчування та бортового раціону космонавтів, розміщені у заскленій круговій вітрині. Серед експонатів видно алюмінієві туби з рідкою їжею та пастами, металеві консервні банки, вакуумні та герметичні упаковки із сублімованими продуктами й хлібцями, а також столові прибори та бортову аптечку."></Card>
        </li>

        <li>
          <Card src="/exhibits/exhibit11.jpg" qrText="На зображенні представлений музейний експонат — макет автоматичної міжпланетної станції «Луна-9» (або «Луна-13»), розташований поверх посадкового ступеня в залі музею. У верхній частині зображено сферичний посадкований апарат із розгорнутими шпилястими антенамі-випромінювачами та науковими датчиками, а під ним — конічний агрегатний відсік із блискучою металевою поверхнею. На задньому плані видно приглушене музейне освітлення з синіми та червоними акцентними підсвітками."></Card>
        </li>

        <li>
          <Card src="/exhibits/exhibit12.jpg" qrText="На зображенні представлений загальний вигляд музейної зали з експозицією «Космос» (зокрема Національного музею космонавтики імені Сергія Корольова в Житомирі), де перебуває численна група відвідувачів. Простір зали оформлений у темних космічних тонах із різнокольоровим художнім підсвічуванням, а вздовж стін і під стелею розміщені численні експонати: космічні апарати, спускаймі капсули з синім неоновим сяйвом, інформаційні стенди, портрети та макети обладнання. На передньому плані видно деталі одного з космічних апаратів, а відвідувачі розглядають експозицію та прогулюються залою."></Card>
        </li>

        <li>
          <Card src="/exhibits/exhibit13.jpg" qrText="На зображенні представлений музейний експонат — помаранчевий польотний костюм (або аварійно-рятувальний комбінезон космонавта), розкладений у заскленій вітрині. У нижній частині вітрини розміщені інші елементи аварійного запасу та спорядження: рятувальний жилет, спецрукавиці та помаранчева сумка з комплектом виживання. На задньому плані крізь вітражне скло видно музейну експозицію з кольоровими художніми панелями та малюнками."></Card>
        </li>

        <li>
          <Card src="/exhibits/exhibit14.jpg" qrText="На зображенні представлений музейний експонат — сферичний спускаймий апарат космічного корабля першого покоління серії «Восток» (або його технологічний макет), встановлений на металевій підставці в залі музею. Темний сферичний корпус оснащений круглими люками, один з яких відкритий і підсвічений зсередини теплим жовтим світлом, демонструючи кабіну з кріслом космонавта. На задньому плані видно музейну експозицію з круглим елементом конструкції, інформаційними вітражами та зоряним тлом."></Card>
        </li>

        <li>
          <Card src="/exhibits/exhibit15.jpg" qrText="На зображенні представлений внутрішній вигляд кабіни спускаймого апарата космічного корабля першого покоління (серії «Восток»), освітлений теплим помаранчево-жовтим світлом. Усередині перебуває манекен космонавта в яскраво-помаранчевому скафандрі та шоломі з написом «СССР». Навколо манекена відтворено інтер'єр кабіни з приладовими панелями, засіб візуального орієнтування (візир «ВЗОР») з круглою сіткою-розміткою у центрі та елементами системи керування політом."></Card>
        </li>
      </ul>
    </div>
  );
};
